<route  lang="json" type="mine">
  {
    "style": { "navigationBarTitleText": "柯臣" }

  }
</route>

<script setup lang="ts">
const scrollViewRef = ref()
const scrollTop = ref(0)
function handleTest() {
  console.log('点击了')
  nextTick(() => {
    scrollTop.value = scrollTop.value === 0 ? 1000 : 0 // 切换滚动位置
  })
}
function handleScroll(e) {
  console.log('scroll', e)
  const scrollView = e.target as HTMLElement
  console.log('scrollTop:', scrollView.scrollTop)
}
</script>

<template>
  <view class=" ">
    <scroll-view ref="scrollViewRef" :scroll-top="scrollTop" scroll-y class="h-600rpx" @scroll="handleScroll">
      今天的天气真是让人心情大好。清晨，阳光透过窗帘洒进屋内，空气清新，温暖的阳光透过树叶的缝隙，投射在地上，形成了一道道斑驳的光影。天上的云朵洁白而轻盈，仿佛是天空中洒落的一片片棉花糖。这样的天气，让人感到无比舒适。

      早晨的温度适中，不冷也不热，给人一种温暖而又不失清新的感觉。空气中弥漫着草木的香气，每一次深呼吸都让人觉得自己像是置身于大自然的怀抱中，身心愉悦。风轻轻地吹过，带着丝丝凉意，仿佛是大自然的轻抚，让人感到放松和宁静。

      随着时间的推移，天气逐渐变得更加明媚。中午时分，太阳高高挂在天空，金灿灿的阳光洒满大地。空气中的温度也有所上升，温暖的阳光让人感到舒适。走在大街上，大家都穿着轻便的衣物，脸上洋溢着轻松和愉快。人们或三五成群地在公园里散步，或在街边的小咖啡馆里喝着饮品，享受着阳光的沐浴。

      尽管气温有所上升，但空气并不干燥，反而带有一丝清爽的湿润感。微风拂过，树叶轻轻摇曳，发出沙沙的声音，仿佛在诉说着这个季节的故事。街上的花坛里，各种鲜花竞相开放，五颜六色的花朵在阳光的照射下愈发显得生动和鲜艳，吸引着人们驻足欣赏。春天的气息在空气中弥漫开来，一切都显得那么生机勃勃。

      然而，到了傍晚，天气开始有所变化。太阳慢慢下沉，天空由湛蓝转为深邃的橙红色，渐渐地，云朵也变得更加丰富多彩，仿佛是一幅美丽的画卷。温度逐渐降低，空气开始变得凉爽，微风也带着一丝寒意。此时，街上的人们纷纷换上了外套，享受着一天中最宜人的时光。黄昏时分，天边的云彩被夕阳染成了金黄色，整个世界似乎被柔和的光线笼罩，静谧而美丽。

      随着夜幕的降临，温度进一步下降，空气变得凉爽。街灯亮起，城市的景象渐渐变得柔和。天上的星星开始一颗颗地闪现，仿佛是夜空中散落的宝石。夜晚的天气宁静而清新，给人一种安宁的感觉。在这样温暖而清爽的夜晚，人们的心情似乎也变得更加轻松与愉快。

      总的来说，今天的天气真是让人心旷神怡。白天温暖而清新，阳光明媚，微风拂面；晚上凉爽而宁静，给人一种放松和舒适的感觉。这样的天气，不仅让大自然显得更加美丽，也让人们的心情变得更加愉悦。希望明天的天气也能如此温暖而宜人，带给我们更多的快乐和舒适。今天的天气真是让人心情大好。清晨，阳光透过窗帘洒进屋内，空气清新，温暖的阳光透过树叶的缝隙，投射在地上，形成了一道道斑驳的光影。天上的云朵洁白而轻盈，仿佛是天空中洒落的一片片棉花糖。这样的天气，让人感到无比舒适。

      早晨的温度适中，不冷也不热，给人一种温暖而又不失清新的感觉。空气中弥漫着草木的香气，每一次深呼吸都让人觉得自己像是置身于大自然的怀抱中，身心愉悦。风轻轻地吹过，带着丝丝凉意，仿佛是大自然的轻抚，让人感到放松和宁静。

      随着时间的推移，天气逐渐变得更加明媚。中午时分，太阳高高挂在天空，金灿灿的阳光洒满大地。空气中的温度也有所上升，温暖的阳光让人感到舒适。走在大街上，大家都穿着轻便的衣物，脸上洋溢着轻松和愉快。人们或三五成群地在公园里散步，或在街边的小咖啡馆里喝着饮品，享受着阳光的沐浴。

      尽管气温有所上升，但空气并不干燥，反而带有一丝清爽的湿润感。微风拂过，树叶轻轻摇曳，发出沙沙的声音，仿佛在诉说着这个季节的故事。街上的花坛里，各种鲜花竞相开放，五颜六色的花朵在阳光的照射下愈发显得生动和鲜艳，吸引着人们驻足欣赏。春天的气息在空气中弥漫开来，一切都显得那么生机勃勃。

      然而，到了傍晚，天气开始有所变化。太阳慢慢下沉，天空由湛蓝转为深邃的橙红色，渐渐地，云朵也变得更加丰富多彩，仿佛是一幅美丽的画卷。温度逐渐降低，空气开始变得凉爽，微风也带着一丝寒意。此时，街上的人们纷纷换上了外套，享受着一天中最宜人的时光。黄昏时分，天边的云彩被夕阳染成了金黄色，整个世界似乎被柔和的光线笼罩，静谧而美丽。

      随着夜幕的降临，温度进一步下降，空气变得凉爽。街灯亮起，城市的景象渐渐变得柔和。天上的星星开始一颗颗地闪现，仿佛是夜空中散落的宝石。夜晚的天气宁静而清新，给人一种安宁的感觉。在这样温暖而清爽的夜晚，人们的心情似乎也变得更加轻松与愉快。

      总的来说，今天的天气真是让人心旷神怡。白天温暖而清新，阳光明媚，微风拂面；晚上凉爽而宁静，给人一种放松和舒适的感觉。这样的天气，不仅让大自然显得更加美丽，也让人们的心情变得更加愉悦。希望明天的天气也能如此温暖而宜人，带给我们更多的快乐和舒适。
    </scroll-view>

    <button @click="handleTest">
      点击啊
    </button>
  </view>
</template>

<style  lang="scss">
</style>
